In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_excel(r'C:\Users\User\My ML Models\Decision Tree\salary.xlsx')
df.head()

  company                  job     degree  salary_100k
0  google      sales executive  bachelors            0
1  google      sales executive    masters            0
2  google     business manager  bachelors            1
3  google     business manager    masters            1
4  google  computer programmer  bachelors            0

In [3]:
#independence and dependence feature
X = df.iloc[:,:-1]
y = df.iloc[:,-1]

In [4]:
#label encoding to convert categorical columns into numerical columns
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [5]:
#label encoding for each columns
X['company_n'] = le_company.fit_transform(X['company'])
X['job_n'] = le_company.fit_transform(X['job'])
X['degree_n'] = le_company.fit_transform(X['degree'])

In [6]:
X.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          1      2         0
1  google      sales executive    masters          1      2         1
2  google     business manager  bachelors          1      0         0
3  google     business manager    masters          1      0         1
4  google  computer programmer  bachelors          1      1         0

In [7]:
#dropping cayegorical columns
df_new = X.drop(['company', 'job', 'degree'], axis='columns')
df_new.head()

   company_n  job_n  degree_n
0          1      2         0
1          1      2         1
2          1      0         0
3          1      0         1
4          1      1         0

In [8]:
#Training our mode
from sklearn.tree import DecisionTreeClassifier
decision_tree = DecisionTreeClassifier()
decision_tree.fit(df_new,y)

DecisionTreeClassifier()

In [9]:
#predictions
decision_tree.predict([[1,2,0]])

array([0], dtype=int64)

In [10]:
decision_tree.predict([[1,0,0]])

array([1], dtype=int64)

In [11]:
#scoring
decision_tree.score(df_new, y)

1.0